docs/benchmark/runs/baseline-e2e-5rps-paymentfix-20260529200108/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/k6/baseline-e2e-5rps.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m30s max duration (incl. graceful stop):
              * baseline_e2e_5rps: 5.00 iterations/s for 1m0s (maxVUs: 10-30, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 4 complete and 0 interrupted iterations
baseline_e2e_5rps   [   2% ] 01/10 VUs  0m01.0s/1m0s  5.00 iters/s

running (0m02.0s), 01/10 VUs, 9 complete and 0 interrupted iterations
baseline_e2e_5rps   [   3% ] 01/10 VUs  0m02.0s/1m0s  5.00 iters/s

running (0m03.0s), 04/10 VUs, 11 complete and 0 interrupted iterations
baseline_e2e_5rps   [   5% ] 04/10 VUs  0m03.0s/1m0s  5.00 iters/s

running (0m04.0s), 01/10 VUs, 19 complete and 0 interrupted iterations
baseline_e2e_5rps   [   7% ] 01/10 VUs  0m04.0s/1m0s  5.00 iters/s

running (0m05.0s), 01/10 VUs, 24 complete and 0 interrupted iterations
baseline_e2e_5rps   [   8% ] 01/10 VUs  0m05.0s/1m0s  5.00 iters/s

running (0m06.0s), 01/10 VUs, 29 complete and 0 interrupted iterations
baseline_e2e_5rps   [  10% ] 01/10 VUs  0m06.0s/1m0s  5.00 iters/s

running (0m07.0s), 01/10 VUs, 34 complete and 0 interrupted iterations
baseline_e2e_5rps   [  12% ] 01/10 VUs  0m07.0s/1m0s  5.00 iters/s

running (0m08.0s), 01/10 VUs, 39 complete and 0 interrupted iterations
baseline_e2e_5rps   [  13% ] 01/10 VUs  0m08.0s/1m0s  5.00 iters/s

running (0m09.0s), 01/10 VUs, 44 complete and 0 interrupted iterations
baseline_e2e_5rps   [  15% ] 01/10 VUs  0m09.0s/1m0s  5.00 iters/s

running (0m10.0s), 01/10 VUs, 49 complete and 0 interrupted iterations
baseline_e2e_5rps   [  17% ] 01/10 VUs  0m10.0s/1m0s  5.00 iters/s

running (0m11.0s), 01/10 VUs, 54 complete and 0 interrupted iterations
baseline_e2e_5rps   [  18% ] 01/10 VUs  0m11.0s/1m0s  5.00 iters/s

running (0m12.0s), 01/10 VUs, 59 complete and 0 interrupted iterations
baseline_e2e_5rps   [  20% ] 01/10 VUs  0m12.0s/1m0s  5.00 iters/s

running (0m13.0s), 01/10 VUs, 64 complete and 0 interrupted iterations
baseline_e2e_5rps   [  22% ] 01/10 VUs  0m13.0s/1m0s  5.00 iters/s

running (0m14.0s), 01/10 VUs, 69 complete and 0 interrupted iterations
baseline_e2e_5rps   [  23% ] 01/10 VUs  0m14.0s/1m0s  5.00 iters/s

running (0m15.0s), 01/10 VUs, 74 complete and 0 interrupted iterations
baseline_e2e_5rps   [  25% ] 01/10 VUs  0m15.0s/1m0s  5.00 iters/s

running (0m16.0s), 01/10 VUs, 79 complete and 0 interrupted iterations
baseline_e2e_5rps   [  27% ] 01/10 VUs  0m16.0s/1m0s  5.00 iters/s

running (0m17.0s), 01/10 VUs, 84 complete and 0 interrupted iterations
baseline_e2e_5rps   [  28% ] 01/10 VUs  0m17.0s/1m0s  5.00 iters/s

running (0m18.0s), 01/10 VUs, 89 complete and 0 interrupted iterations
baseline_e2e_5rps   [  30% ] 01/10 VUs  0m18.0s/1m0s  5.00 iters/s

running (0m19.0s), 01/10 VUs, 94 complete and 0 interrupted iterations
baseline_e2e_5rps   [  32% ] 01/10 VUs  0m19.0s/1m0s  5.00 iters/s

running (0m20.0s), 01/10 VUs, 99 complete and 0 interrupted iterations
baseline_e2e_5rps   [  33% ] 01/10 VUs  0m20.0s/1m0s  5.00 iters/s

running (0m21.0s), 01/10 VUs, 104 complete and 0 interrupted iterations
baseline_e2e_5rps   [  35% ] 01/10 VUs  0m21.0s/1m0s  5.00 iters/s

running (0m22.0s), 01/10 VUs, 109 complete and 0 interrupted iterations
baseline_e2e_5rps   [  37% ] 01/10 VUs  0m22.0s/1m0s  5.00 iters/s

running (0m23.0s), 01/10 VUs, 114 complete and 0 interrupted iterations
baseline_e2e_5rps   [  38% ] 01/10 VUs  0m23.0s/1m0s  5.00 iters/s

running (0m24.0s), 01/10 VUs, 119 complete and 0 interrupted iterations
baseline_e2e_5rps   [  40% ] 01/10 VUs  0m24.0s/1m0s  5.00 iters/s

running (0m25.0s), 01/10 VUs, 124 complete and 0 interrupted iterations
baseline_e2e_5rps   [  42% ] 01/10 VUs  0m25.0s/1m0s  5.00 iters/s

running (0m26.0s), 01/10 VUs, 129 complete and 0 interrupted iterations
baseline_e2e_5rps   [  43% ] 01/10 VUs  0m26.0s/1m0s  5.00 iters/s

running (0m27.0s), 01/10 VUs, 134 complete and 0 interrupted iterations
baseline_e2e_5rps   [  45% ] 01/10 VUs  0m27.0s/1m0s  5.00 iters/s

running (0m28.0s), 01/10 VUs, 139 complete and 0 interrupted iterations
baseline_e2e_5rps   [  47% ] 01/10 VUs  0m28.0s/1m0s  5.00 iters/s

running (0m29.0s), 01/10 VUs, 144 complete and 0 interrupted iterations
baseline_e2e_5rps   [  48% ] 01/10 VUs  0m29.0s/1m0s  5.00 iters/s

running (0m30.0s), 01/10 VUs, 149 complete and 0 interrupted iterations
baseline_e2e_5rps   [  50% ] 01/10 VUs  0m30.0s/1m0s  5.00 iters/s

running (0m31.0s), 01/10 VUs, 154 complete and 0 interrupted iterations
baseline_e2e_5rps   [  52% ] 01/10 VUs  0m31.0s/1m0s  5.00 iters/s

running (0m32.0s), 01/10 VUs, 159 complete and 0 interrupted iterations
baseline_e2e_5rps   [  53% ] 01/10 VUs  0m32.0s/1m0s  5.00 iters/s

running (0m33.0s), 02/10 VUs, 163 complete and 0 interrupted iterations
baseline_e2e_5rps   [  55% ] 02/10 VUs  0m33.0s/1m0s  5.00 iters/s

running (0m34.0s), 01/10 VUs, 169 complete and 0 interrupted iterations
baseline_e2e_5rps   [  57% ] 01/10 VUs  0m34.0s/1m0s  5.00 iters/s

running (0m35.0s), 01/10 VUs, 174 complete and 0 interrupted iterations
baseline_e2e_5rps   [  58% ] 01/10 VUs  0m35.0s/1m0s  5.00 iters/s

running (0m36.0s), 01/10 VUs, 179 complete and 0 interrupted iterations
baseline_e2e_5rps   [  60% ] 01/10 VUs  0m36.0s/1m0s  5.00 iters/s

running (0m37.0s), 01/10 VUs, 184 complete and 0 interrupted iterations
baseline_e2e_5rps   [  62% ] 01/10 VUs  0m37.0s/1m0s  5.00 iters/s

running (0m38.0s), 01/10 VUs, 189 complete and 0 interrupted iterations
baseline_e2e_5rps   [  63% ] 01/10 VUs  0m38.0s/1m0s  5.00 iters/s

running (0m39.0s), 01/10 VUs, 194 complete and 0 interrupted iterations
baseline_e2e_5rps   [  65% ] 01/10 VUs  0m39.0s/1m0s  5.00 iters/s

running (0m40.0s), 01/10 VUs, 199 complete and 0 interrupted iterations
baseline_e2e_5rps   [  67% ] 01/10 VUs  0m40.0s/1m0s  5.00 iters/s

running (0m41.0s), 01/10 VUs, 204 complete and 0 interrupted iterations
baseline_e2e_5rps   [  68% ] 01/10 VUs  0m41.0s/1m0s  5.00 iters/s

running (0m42.0s), 01/10 VUs, 209 complete and 0 interrupted iterations
baseline_e2e_5rps   [  70% ] 01/10 VUs  0m42.0s/1m0s  5.00 iters/s

running (0m43.0s), 01/10 VUs, 214 complete and 0 interrupted iterations
baseline_e2e_5rps   [  72% ] 01/10 VUs  0m43.0s/1m0s  5.00 iters/s

running (0m44.0s), 01/10 VUs, 219 complete and 0 interrupted iterations
baseline_e2e_5rps   [  73% ] 01/10 VUs  0m44.0s/1m0s  5.00 iters/s

running (0m45.0s), 01/10 VUs, 224 complete and 0 interrupted iterations
baseline_e2e_5rps   [  75% ] 01/10 VUs  0m45.0s/1m0s  5.00 iters/s

running (0m46.0s), 01/10 VUs, 229 complete and 0 interrupted iterations
baseline_e2e_5rps   [  77% ] 01/10 VUs  0m46.0s/1m0s  5.00 iters/s

running (0m47.0s), 01/10 VUs, 234 complete and 0 interrupted iterations
baseline_e2e_5rps   [  78% ] 01/10 VUs  0m47.0s/1m0s  5.00 iters/s

running (0m48.0s), 01/10 VUs, 239 complete and 0 interrupted iterations
baseline_e2e_5rps   [  80% ] 01/10 VUs  0m48.0s/1m0s  5.00 iters/s

running (0m49.0s), 01/10 VUs, 244 complete and 0 interrupted iterations
baseline_e2e_5rps   [  82% ] 01/10 VUs  0m49.0s/1m0s  5.00 iters/s

running (0m50.0s), 01/10 VUs, 249 complete and 0 interrupted iterations
baseline_e2e_5rps   [  83% ] 01/10 VUs  0m50.0s/1m0s  5.00 iters/s

running (0m51.0s), 01/10 VUs, 254 complete and 0 interrupted iterations
baseline_e2e_5rps   [  85% ] 01/10 VUs  0m51.0s/1m0s  5.00 iters/s

running (0m52.0s), 01/10 VUs, 259 complete and 0 interrupted iterations
baseline_e2e_5rps   [  87% ] 01/10 VUs  0m52.0s/1m0s  5.00 iters/s

running (0m53.0s), 01/10 VUs, 264 complete and 0 interrupted iterations
baseline_e2e_5rps   [  88% ] 01/10 VUs  0m53.0s/1m0s  5.00 iters/s

running (0m54.0s), 01/10 VUs, 269 complete and 0 interrupted iterations
baseline_e2e_5rps   [  90% ] 01/10 VUs  0m54.0s/1m0s  5.00 iters/s

running (0m55.0s), 01/10 VUs, 274 complete and 0 interrupted iterations
baseline_e2e_5rps   [  92% ] 01/10 VUs  0m55.0s/1m0s  5.00 iters/s

running (0m56.0s), 01/10 VUs, 279 complete and 0 interrupted iterations
baseline_e2e_5rps   [  93% ] 01/10 VUs  0m56.0s/1m0s  5.00 iters/s

running (0m57.0s), 01/10 VUs, 284 complete and 0 interrupted iterations
baseline_e2e_5rps   [  95% ] 01/10 VUs  0m57.0s/1m0s  5.00 iters/s

running (0m58.0s), 01/10 VUs, 289 complete and 0 interrupted iterations
baseline_e2e_5rps   [  97% ] 01/10 VUs  0m58.0s/1m0s  5.00 iters/s

running (0m59.0s), 01/10 VUs, 294 complete and 0 interrupted iterations
baseline_e2e_5rps   [  98% ] 01/10 VUs  0m59.0s/1m0s  5.00 iters/s

running (1m00.0s), 01/10 VUs, 299 complete and 0 interrupted iterations
baseline_e2e_5rps   [ 100% ] 01/10 VUs  1m00.0s/1m0s  5.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1500' p(95)=130.52ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    unexpected_error_rate
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 301     4.99781/s
    checks_succeeded...: 100.00% 301 out of 301
    checks_failed......: 0.00%   0 out of 301

    ✓ order request accepted or rejected

    CUSTOM
    accepted_orders................: 301    4.99781/s
    unexpected_error_rate..........: 0.00%  0 out of 301

    HTTP
    http_req_duration..............: avg=41.05ms  min=17.16ms  med=26.1ms  max=624.79ms p(90)=51.94ms p(95)=130.52ms
      { expected_response:true }...: avg=41.05ms  min=17.16ms  med=26.1ms  max=624.79ms p(90)=51.94ms p(95)=130.52ms
    http_req_failed................: 0.00%  0 out of 301
    http_reqs......................: 301    4.99781/s

    EXECUTION
    iteration_duration.............: avg=242.29ms min=217.92ms med=227.2ms max=826.17ms p(90)=254.1ms p(95)=331.02ms
    iterations.....................: 301    4.99781/s
    vus............................: 1      min=1        max=4 
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 254 kB 4.2 kB/s
    data_sent......................: 142 kB 2.4 kB/s



running (1m00.2s), 00/10 VUs, 301 complete and 0 interrupted iterations
baseline_e2e_5rps ✓ [ 100% ] 00/10 VUs  1m0s  5.00 iters/s